<template>
  <div>
    <v-dialog
      v-model="open"
      persistent
      width="500"
    >
      <v-card>
        <v-card-title
          class="headline"
          primary-title
        >
          都督微办公注册协议
        </v-card-title>

        <v-card-text>
          一、 “都督微办公”运用自己开发的软件系统，通过移动互联网络和用户移动终端设备，为用户提供办公类应用软件。“都督微办公”有权在必要时修改服务条款，服务条款一旦发生变动，将会在重要页面上提示修改内容或通过其他形式告知用户。如果用户继续使用“都督微办公”所提供的网络服务，则视为接受服务条款的变动。“都督微办公”保留随时修改服务条款而不需知照用户的权利。
          <br>
          <br>
          二、保护用户隐私权
          <br>
          您注册并使用“都督微办公”相关服务时，根据网站要求提供相关个人信息；在您使用“都督微办公”服务或访问网站网页时，您的微信号将被网站自动记录并用于登录和身份识别；“都督微办公”承诺不公开或透露您的姓名、工作单位、手机号码等在本站的非公开信息。除非因用户本人的需要、法律或其他合法程序的要求、服务条款的改变或修订等。
          为服务用户的目的，“都督微办公”可能通过使用您的个人信息，向您提供服务，包括但不限于向您发出活动信息，以及推送各类服务信息等。
          同时用户须做到：
          <br>
          ● 注册信息与使用应符合网络道德，遵守中华人民共和国的相关法律法规；
          <br>
          ● 注册信息中不能含有威胁、淫秽、漫骂、非法、侵害他人权益等有争议性的文字；
          <br>
          ● 注册成功后，因用户本人原因泄露个人信息而造成的任何损失由用户本人负责；
          <br>
          ● 不得盗用他人帐号，由此行为造成的后果自负。
          <br>
          <br>
          您的个人信息将在下述情况下部分或全部被披露：
          <br>
          ● 经您同意，向第三方披露；
          <br>
          ● 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
          <br>
          ● 如果您出现违反中国有关法律或者网站政策的情况，需要向第三方披露；
          <br>
          ● 为提供你所要求的产品和服务，而必须和第三方分享您的个人信息；
          <br>
          ● 其他本网站根据法律或者网站政策认为合适的披露。
          <br>
          <br>
          三、责任说明
          <br>
          基于技术和不可预见的原因而导致的服务中断，或者因用户的非法操作而造成的损失，“都督微办公”不负责任。用户应当自行承担一切因自身行为而直接或者间接导致的民事或刑事法律责任。
          <br>
          <br>
          四、用户必须做到：
          <br>
          1、根据用户需要，按照协议约定缴纳相应费用并使用相应服务，否则“都督微办公”有权随时停止为欠费用户提供服务。用户付费后自行注销机构的，“都督微办公”不退回余下费用。
          <br>
          2、不得利用本站危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本站制作、复制和传播下列信息：
          <br>
          （1）煽动抗拒、破坏宪法和法律、行政法规实施的；
          <br>
          （2）煽动颠覆国家政权，推翻社会主义制度的；
          <br>
          （3）煽动分裂国家、破坏国家统一的；
          <br>
          （4）煽动民族仇恨、民族歧视，破坏民族团结的；
          <br>
          （5）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；
          <br>
          （6）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；
          <br>
          （7）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；
          <br>
          （8）损害国家机关信誉的；
          <br>
          （9）其他违反宪法和法律行政法规的；
          <br>
          （10）进行商业广告行为的。
          <br>
          3、未经本站的授权或许可，任何用户不得借用本站的名义从事任何商业活动，也不得将本站作为从事商业活动的场所、平台或其他任何形式的媒介。禁止将本站用作从事各种非法活动的场所、平台或者其他任何形式的媒介。违反者若触犯法律，一切后果自负，本站不承担任何责任。
          同时，“都督微办公”保留删除站内各类不符合规定信息而不通知用户的权利。
          五、免责声明：
          <br>
          ● “都督微办公”是为互联网用户提供信息存储空间和应用软件的互联网服务提供者，对于任何包含、经由或连接、下载或从任何与有关本网站所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本网站上的内容、广告、展示而购买、取得的任何产品、信息或资料，“都督微办公”不负保证责任。用户自行负担使用本网站的风险。
          <br>
          ● “都督微办公”有权但无义务，改善或更正本网站任何部分之任何疏漏、错误。
          <br>
          ● 本站内相关信息内容仅代表发布者的个人观点，并不表示本站赞同其观点或证实其描述，本站不承担由此引发的法律责任。
          <br>
          ● 用户在“都督微办公”时应对自己所发布信息进行保密审查，因用户发布涉密内容而造成泄密行为的，本站概不负责。
          <br>
          ● 用户在“都督微办公”创建机构并邀请其他用户加入机构，则自行对受邀进入机构的用户在“都督微办公”的言论负责，本站概不负责。
        </v-card-text>

        <v-divider/>

        <v-card-actions>
          <v-spacer/>
          <v-btn
            color="primary"
            flat
            @click="$emit('update:open', false)"
          >
            我接受
          </v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
  </div>
</template>

<script>
export default {
	name: "Statement",
	props: {
		open: {
			type: Boolean,
			default: false,
		}
	},
};
</script>

<style scoped>
</style>